
Jess, the Rule Engine for the Java Platform
Copyright (C) 2008 Sandia Corporation
Jess Version 7.1p2 11/5/2008

Jess> (batch "blocks.clp")
TRUE
Jess> (watch all)
TRUE
Jess> (facts)
f-0   (MAIN::initial-fact)
f-1   (MAIN::block a)
f-2   (MAIN::block b)
f-3   (MAIN::block c)
f-4   (MAIN::block d)
f-5   (MAIN::block e)
f-6   (MAIN::on-top-of (top nothing) (bottom b))
f-7   (MAIN::on-top-of (top b) (bottom a))
f-8   (MAIN::on-top-of (top a) (bottom floor))
f-9   (MAIN::on-top-of (top nothing) (bottom c))
f-10   (MAIN::on-top-of (top c) (bottom floor))
f-11   (MAIN::on-top-of (top nothing) (bottom e))
f-12   (MAIN::on-top-of (top e) (bottom d))
f-13   (MAIN::on-top-of (top d) (bottom floor))
f-14   (MAIN::goal (move a) (on-top-of c) (state unsatisfied) (step 0))
f-15   (MAIN::goal (move b) (on-top-of a) (state new) (step 1))
f-16   (MAIN::step (count 0))
For a total of 17 facts in module MAIN.
Jess> (agenda)
[Activation: MAIN::clear-upper-block  f-14, f-1, f-7, f-2 ; time=15 ; totalTime=28 ; salience=0]
For a total of 1 activations in module MAIN.
Jess> (run 1)
FIRE 1 MAIN::clear-upper-block f-14, f-1, f-7, f-2
 ==> f-17 (MAIN::goal (move b) (on-top-of floor) (state unsatisfied) (step nil))
==> Activation: MAIN::move-to-floor :  f-17, f-2, f-6, f-7
New sub-goal: move b to floor.
1
Jess> (run)
FIRE 1 MAIN::move-to-floor f-17, f-2, f-6, f-7
 <== f-7 (MAIN::on-top-of (top b) (bottom a))
 <=> f-17 (MAIN::goal (move b) (on-top-of floor) (state satisfied) (step nil))
 ==> f-18 (MAIN::on-top-of (top b) (bottom floor))
 ==> f-19 (MAIN::on-top-of (top nothing) (bottom a))
==> Activation: MAIN::move-directly :  f-14, f-1, f-3, f-19, f-8, f-9
b moved to floor.
FIRE 2 MAIN::move-directly f-14, f-1, f-3, f-19, f-8, f-9
 <== f-8 (MAIN::on-top-of (top a) (bottom floor))
 <== f-9 (MAIN::on-top-of (top nothing) (bottom c))
 <=> f-14 (MAIN::goal (move a) (on-top-of c) (state satisfied) (step 0))
==> Activation: MAIN::enable-next-goal :  f-14, f-16, f-15
 ==> f-20 (MAIN::on-top-of (top a) (bottom c))
 ==> f-21 (MAIN::on-top-of (top nothing) (bottom floor))
==> Activation: MAIN::clear-null-fact :  f-21
a moved on top of c.
FIRE 3 MAIN::clear-null-fact f-21
 <== f-21 (MAIN::on-top-of (top nothing) (bottom floor))
deleted empty fact: (top nothing) (bottom floor).
FIRE 4 MAIN::enable-next-goal f-14, f-16, f-15
 <=> f-16 (MAIN::step (count 1))
 <=> f-15 (MAIN::goal (move b) (on-top-of a) (state unsatisfied) (step 1))
==> Activation: MAIN::move-directly :  f-15, f-2, f-1, f-6, f-18, f-19
FIRE 5 MAIN::move-directly f-15, f-2, f-1, f-6, f-18, f-19
 <== f-18 (MAIN::on-top-of (top b) (bottom floor))
 <== f-19 (MAIN::on-top-of (top nothing) (bottom a))
 <=> f-15 (MAIN::goal (move b) (on-top-of a) (state satisfied) (step 1))
 ==> f-22 (MAIN::on-top-of (top b) (bottom a))
 ==> f-23 (MAIN::on-top-of (top nothing) (bottom floor))
==> Activation: MAIN::clear-null-fact :  f-23
b moved on top of a.
FIRE 6 MAIN::clear-null-fact f-23
 <== f-23 (MAIN::on-top-of (top nothing) (bottom floor))
deleted empty fact: (top nothing) (bottom floor).
 <== Focus MAIN
6
Jess> (facts)
f-0   (MAIN::initial-fact)
f-1   (MAIN::block a)
f-2   (MAIN::block b)
f-3   (MAIN::block c)
f-4   (MAIN::block d)
f-5   (MAIN::block e)
f-6   (MAIN::on-top-of (top nothing) (bottom b))
f-10   (MAIN::on-top-of (top c) (bottom floor))
f-11   (MAIN::on-top-of (top nothing) (bottom e))
f-12   (MAIN::on-top-of (top e) (bottom d))
f-13   (MAIN::on-top-of (top d) (bottom floor))
f-14   (MAIN::goal (move a) (on-top-of c) (state satisfied) (step 0))
f-15   (MAIN::goal (move b) (on-top-of a) (state satisfied) (step 1))
f-16   (MAIN::step (count 1))
f-17   (MAIN::goal (move b) (on-top-of floor) (state satisfied) (step nil))
f-20   (MAIN::on-top-of (top a) (bottom c))
f-22   (MAIN::on-top-of (top b) (bottom a))
For a total of 17 facts in module MAIN.
Jess> (agenda)
For a total of 0 activations in module MAIN.
Jess> (exit)
